app/controllers/enrolls_controller.rb

SELECT "enrolls".* FROM "enrolls"
---
  def index
    @enrolls = Enroll.all

INSERT INTO "enrolls" ("firstname", "lastname", "phone", "email", "dogname", "dogage", "dogbreed", "dogweight", "startdate", "enddate", "consent", "needs", "vaccine", "pickup", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"
---
  def create
    @enroll = Enroll.new(enroll_params)

    if @enroll.save